src/InformationRegisters/Наценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Наценки</Name>
			<Comment>Наценки на товары</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНаценки</Name>
					<Comment>Сумма наценки на товар</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяНаценка</Name>
					<Comment>Минимальная наценка на товар</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ЦенообразованиеВызовСервера/Ext/Module.bsl
// Общий модуль "Ценообразование вызов сервера"

Функция ПолучитьЗапросИерархии(Запрос, ПодразделениеНаценки, КонтрагентНаценки, НоменклатураНаценки)
	
	ТекстИерархии = "";
	
	МассивКонтрагентов  = Новый Массив;
	МассивПодразделений = Новый Массив;
	МассивНоменклатуры  = Новый Массив;
	
	Запрос.УстановитьПараметр("Контрагент1", КонтрагентНаценки);
	МассивКонтрагентов.Добавить(КонтрагентНаценки);
	
	Если ЗначениеЗаполнено(КонтрагентНаценки) Тогда
		Запрос.УстановитьПараметр("Контрагент2", Справочники.Контрагенты.ПустаяСсылка());
		МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	
	// Иерархия Подразделений
	
	Запрос.УстановитьПараметр("Подразделение1", ПодразделениеНаценки);
	МассивПодразделений.Добавить(ПодразделениеНаценки);
	
	ТекРодитель   = ПодразделениеНаценки.Родитель;
	Уровень       = 2;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("Подразделение"+ТекстУровень, ТекРодитель);
		
		МассивПодразделений.Добавить(ТекРодитель);
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
		
	Если ЗначениеЗаполнено(ПодразделениеНаценки) Тогда
		ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("Подразделение"+ТекстУровень, Справочники.ПодразделенияКомпании.ПустаяСсылка());
		МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	КонецЕсли;
	
	ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
	
	ФорматПриоритетаПодразделений = "ЧЦ="+СтрДлина(ТекстУровень)+"; ЧВН=; ЧГ=";
	
	Запрос.УстановитьПараметр("Номенклатура1", НоменклатураНаценки);
	МассивНоменклатуры.Добавить(НоменклатураНаценки);
	
	// Иерархия Номенклатуры
	ТекРодитель = НоменклатураНаценки.Родитель;
	Уровень     = 2;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("Номенклатура"+ТекстУровень, ТекРодитель);
		МассивНоменклатуры.Добавить(ТекРодитель);
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
	
	ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
	
	Если ЗначениеЗаполнено(НоменклатураНаценки.ТипНоменклатуры) Тогда
		Запрос.УстановитьПараметр("Номенклатура"+ТекстУровень, НоменклатураНаценки.ТипНоменклатуры);
		МассивНоменклатуры.Добавить(НоменклатураНаценки.ТипНоменклатуры);
	КонецЕсли;
	
	ФорматПриоритета = "ЧЦ="+СтрДлина(ТекстУровень)+"; ЧВН=; ЧГ=";
	
	УровеньКонтрагента = 1;
	ПервыйЦикл = Истина;
	Для Каждого ТекущийКонтрагент Из МассивКонтрагентов Цикл
		УровеньПодразделения = 1;
		Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
			Уровень = 1;
			Для Каждого ТекущийРодитель Из МассивНоменклатуры Цикл
				
				ТекстУровеньКонтрагента   = Формат(УровеньКонтрагента,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
				ТекстУровеньПодразделения = Формат(УровеньПодразделения,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
				ТекстУровень              = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
				
				ТекстПриоритета           = ТекстУровеньКонтрагента + Формат(УровеньПодразделения, ФорматПриоритетаПодразделений) + Формат(ТекстУровень, ФорматПриоритета);
				
				Если ПервыйЦикл Тогда
					ТекстИерархии = "
					|ВЫБРАТЬ
					|	&ТипЦен КАК ТипЦен,
					|	&Номенклатура1 КАК Номенклатура,
					|	&Подразделение1 КАК Подразделение,
					|	&Контрагент1 КАК Контрагент,
					|	"+ТекстПриоритета+" КАК Приоритет
					|ПОМЕСТИТЬ
					|	ТаблицаНоменклатуры
					|";
					
					ПервыйЦикл = Ложь;
				Иначе
					ТекстИерархии = ТекстИерархии+"
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ
					|	&ТипЦен,
					|	&Номенклатура"+ТекстУровень+",
					|	&Подразделение"+ТекстУровеньПодразделения+",
					|	&Контрагент"+ТекстУровеньКонтрагента+",
					|	"+ТекстПриоритета;
				КонецЕсли;
				
				Уровень = Уровень+1;
				
			КонецЦикла;
			
			УровеньПодразделения = УровеньПодразделения + 1;
		КонецЦикла;
		
		УровеньКонтрагента = УровеньКонтрагента + 1;
		
	КонецЦикла;
	
	Возврат ТекстИерархии;
	
КонецФункции

// получить наценку и ограничение на товар по указанному типу цены.
// поиск ведется начиная с переданного элемента и по всем родителям
// элемента
Функция ПолучитьНаценкуОграничение(МоментВремени, ТипЦен, Номенклатура, Знач КонтрагентНаценки = Неопределено, Знач ПодразделениеНаценки = Неопределено) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("ПроцентНаценки", 0);
	//Данные.Вставить("Отклонение",     0);
	
	Если Не ЗначениеЗаполнено(КонтрагентНаценки) Тогда
		КонтрагентНаценки = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПодразделениеНаценки) Тогда
		ПодразделениеНаценки = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстИерархииНоменклатуры = "";
	ТекРодитель   = Номенклатура.Родитель;
	Уровень       = 2;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("Номенклатура"+ТекстУровень, ТекРодитель);
		
		ТекстИерархииНоменклатуры = ТекстИерархииНоменклатуры+"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	&ТипЦен,
		|	&Номенклатура"+ТекстУровень+",
		|	"+ТекстУровень;
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Номенклатура.ТипНоменклатуры) Тогда
		
		ТекстУровень = Формат(Уровень,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Запрос.УстановитьПараметр("Номенклатура"+ТекстУровень, Номенклатура.ТипНоменклатуры);
		
		ТекстИерархииНоменклатуры = ТекстИерархииНоменклатуры+"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	&ТипЦен,
		|	&Номенклатура"+ТекстУровень+",
		|	"+ТекстУровень;
		
	КонецЕсли;
	
	ТекстИерархииНоменклатуры = "
	|ВЫБРАТЬ
	|	&ТипЦен КАК ТипЦен,
	|	&Номенклатура КАК Номенклатура,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаНоменклатурыДляНаценки
	|" + ТекстИерархииНоменклатуры + "
	|;
	|";
	
	Если ЗначениеЗаполнено(КонтрагентНаценки) ИЛИ ЗначениеЗаполнено(ПодразделениеНаценки) Тогда
		
		ТекстИерархии = ПолучитьЗапросИерархии(Запрос, ПодразделениеНаценки, КонтрагентНаценки, Номенклатура);
		
		ТекстЗапроса = ТекстИерархииНоменклатуры + ТекстИерархии + "
		|;
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
		//|	Наценки.Отклонение КАК Отклонение,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ
		|	ПодзапросПоКонтрагенту
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.НаценкиКонтрагентов КАК Наценки
		|ПО
		|	ТаблицаНоменклатуры.ТипЦен = Наценки.ТипЦен И 
		|	ТаблицаНоменклатуры.Номенклатура = Наценки.Номенклатура И 
		|	ТаблицаНоменклатуры.Подразделение = Наценки.Подразделение И 
		|	ТаблицаНоменклатуры.Контрагент = Наценки.Контрагент
		|ГДЕ
		|	Наценки.ПроцентНаценки <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаНоменклатуры.Приоритет
		|;
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
		//|	Наценки.Отклонение КАК Отклонение,
		|	2 КАК Приоритет
		|ПОМЕСТИТЬ
		|	ПодзапросБезКонтрагента
		|ИЗ
		|	ТаблицаНоменклатурыДляНаценки КАК ТаблицаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Наценки КАК Наценки
		|ПО
		|	ТаблицаНоменклатуры.Номенклатура = Наценки.Номенклатура И 
		|	ТаблицаНоменклатуры.ТипЦен = Наценки.ТипЦен
		|ГДЕ
		|	Наценки.ПроцентНаценки <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаНоменклатуры.Приоритет
		|;
		|
		|ВЫБРАТЬ
		|	Подзапрос.ПроцентНаценки КАК ПроцентНаценки,
		//|	Подзапрос.Отклонение КАК Отклонение,
		|	Подзапрос.Приоритет КАК Приоритет
		|ИЗ
		|	ПодзапросПоКонтрагенту КАК Подзапрос
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|	
		|ВЫБРАТЬ
		|	Подзапрос.ПроцентНаценки КАК ПроцентНаценки,
		//|	Подзапрос.Отклонение КАК Отклонение,
		|	Подзапрос.Приоритет КАК Приоритет
		|ИЗ
		|	ПодзапросБезКонтрагента КАК Подзапрос
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
	Иначе
		
		ТекстЗапроса = ТекстИерархииНоменклатуры + ТекстИерархии + "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
		//|	Наценки.Отклонение КАК Отклонение,
		|	ТаблицаНоменклатуры.Приоритет
		|ИЗ
		|	ТаблицаНоменклатурыДляНаценки КАК ТаблицаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Наценки КАК Наценки
		|ПО
		|	ТаблицаНоменклатуры.Номенклатура = Наценки.Номенклатура И 
		|	ТаблицаНоменклатуры.ТипЦен = Наценки.ТипЦен
		|ГДЕ
		|	Наценки.ПроцентНаценки <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаНоменклатуры.Приоритет
		|";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен",       ТипЦен);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Данные.Вставить("ПроцентНаценки", Выборка.ПроцентНаценки);
		Данные.Вставить("Отклонение",     Выборка.Отклонение);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции
